# Задача 1
# Строка представляет собой арифметическое выражение
# из однозначных чисел и знаков + и -.
# Вычислите результат.
# Пример
# Ввод
# 8-5+2-1
# Вывод
# 4

# some_str = (input(int('Введите однозначные числа и знаки + и -: ')))

# print(some_str)

# Словом в данной задаче считается последовательность букв, ограниченная пробелами или началом или концом строки.
# Выведите все слова из строки в столбик. НЕЛЬЗЯ ПОЛЬЗОВАТЬСЯ МЕТОДАМИ СТРОК (split)

# Формат ввода
# Вводится строка.

# Формат вывода
# Выведите слова из строки по одному.

# some_str = input('Введите строку: ')

# for i in range(1, len(some_str)):
#     if some_str[i] == ' ':
#         '\n'
#     print(some_str)



    









